Reports/ОтчетПоРолямИДопПравамПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОтчетПоРолямИДопПравамПользователей</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>РолиПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРоли</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеРоли</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрофильСодержитРоль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ЗначенияДополнительныхПравПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхПравПользователя</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПраваПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрофилиПолномочийПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Право</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПраваПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПользователиПоЦФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПользователиПоЦФО</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РуководительОтдела</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрофильПолномочийПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиПолномочийПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдминистраторEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Технолог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециалистПоУпаковке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросмотрВсехМагазиновВНовойВкусвилл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АК_ВнутренийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентАутсорсинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСотрудниковАутсорсинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСотрудниковАутсорсинг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСоздаватьЗаданияПоЗаявкамНаРасходование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноУдалениеТоварныхОпераций</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодчиненныеПользователи</Name>
					<Comment>пока что это сделано для установки границ запрета, возможно потом расширится</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ОтчетПоРолямИДопПравамПользователей/Ext/ManagerModule.bsl
Функция ПолучитьТаблицуДанных(МассивРолей = Неопределено) Экспорт
	
	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	ТаблицаРолей = Новый ТаблицаЗначений;
	ТаблицаРолей.Колонки.Добавить("НаименованиеРолиПрава"	, Новый ОписаниеТипов("Строка"));
	ТаблицаРолей.Колонки.Добавить("Пользователь"			, Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	
	СпрПользователи = Справочники.Пользователи;
	Для Каждого ПользовательИБ Из ПользователиИБ Цикл
		Если ПользовательИБ.ПоказыватьВСпискеВыбора = Ложь
				И НЕ ПользовательИБ.АутентификацияОС Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ТекРоль Из ПользовательИБ.Роли Цикл
			Если (НЕ МассивРолей = Неопределено)
					И МассивРолей.Найти(ТекРоль.Имя) = Неопределено Тогда // не входит в выбранный на форме отчета список ролей
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ТаблицаРолей.Добавить();
			НоваяСтрока.НаименованиеРолиПрава 	= ТекРоль.Имя;
			НоваяСтрока.Пользователь 			= СпрПользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);
		КонецЦикла;
	КонецЦикла;
	
	
	//
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаРолей"		, ТаблицаРолей);
	Запрос.УстановитьПараметр("МассивПользователей"	, ТаблицаРолей.ВыгрузитьКолонку("Пользователь"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаРолей.НаименованиеРолиПрава КАК НаименованиеРолиПрава,
	|	ТаблицаРолей.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ ВТТаблицаРолей
	|ИЗ
	|	&ТаблицаРолей КАК ТаблицаРолей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТаблицаРолей.Пользователь КАК Пользователь,
	|	ВТТаблицаРолей.НаименованиеРолиПрава КАК НаименованиеРолиПрава,
	|	"""" КАК ПравоРодитель,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПраваПользователей.ПустаяСсылка) КАК Право,
	|	ЛОЖЬ КАК ПравоЭтоГруппа,
	|	ИСТИНА КАК ЗначениеПрава,
	|	ЛОЖЬ КАК ПризнакДопПраво
	|ПОМЕСТИТЬ ВТОсновная
	|ИЗ
	|	ВТТаблицаРолей КАК ВТТаблицаРолей
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗначениеПрав.Пользователь,
	|	Права.Наименование,
	|	Права.Родитель.Наименование,
	|	Права.Ссылка,
	|	Права.ЭтоГруппа,
	|	ЗначениеПрав.Значение,
	|	ИСТИНА
	|ИЗ
	|	ПланВидовХарактеристик.ПраваПользователей КАК Права
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхПравПользователя КАК ЗначениеПрав
	|		ПО (ЗначениеПрав.Право = Права.Ссылка)
	|			И (ЗначениеПрав.Пользователь В (&МассивПользователей))
	|			И (ТИПЗНАЧЕНИЯ(ЗначениеПрав.Значение) = ТИП(БУЛЕВО))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПользователиПОЦФО.Период,
	|	ПользователиПОЦФО.Сотрудник,
	|	ПользователиПОЦФО.ЦФО
	|ПОМЕСТИТЬ ВТЦФОПользователей
	|ИЗ
	|	РегистрСведений.ПользователиПоЦФО.СрезПоследних(, Сотрудник В (&МассивПользователей)) КАК ПользователиПОЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОсновная.Пользователь КАК Пользователь,
	|	ВТОсновная.НаименованиеРолиПрава КАК НаименованиеРолиПрава,
	|	ВТОсновная.ПравоРодитель,
	|	ВТОсновная.Право,
	|	ВТОсновная.ПравоЭтоГруппа,
	|	ВТОсновная.ЗначениеПрава,
	|	ВТОсновная.ПризнакДопПраво,
	|	ЕСТЬNULL(ЦФОПользователей.ЦФО, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК ЦФО
	|ИЗ
	|	ВТОсновная КАК ВТОсновная
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТЦФОПользователей.Сотрудник КАК Сотрудник,
	|			ВТЦФОПользователей.ЦФО КАК ЦФО
	|		ИЗ
	|			ВТЦФОПользователей КАК ВТЦФОПользователей
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ВТЦФОПользователей.Сотрудник КАК Сотрудник,
	|					МАКСИМУМ(ВТЦФОПользователей.Период) КАК Период
	|				ИЗ
	|					ВТЦФОПользователей КАК ВТЦФОПользователей
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ВТЦФОПользователей.Сотрудник) КАК МаксПериоды
	|				ПО (МаксПериоды.Сотрудник = ВТЦФОПользователей.Сотрудник)
	|					И (МаксПериоды.Период = ВТЦФОПользователей.Период)) КАК ЦФОПользователей
	|		ПО (ЦФОПользователей.Сотрудник = ВТОсновная.Пользователь)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
